In [1]:
from pandas import DataFrame, read_csv

import matplotlib.pyplot as plt
import pandas as pd
import sys
import matplotlib

%matplotlib inline

print('Python version:' + sys.version)
print('Pandas version:' + pd.__version__)
print('Matplotlib version:' + matplotlib.__version__)

Python version:3.6.5 |Anaconda, Inc.| (default, Mar 29 2018, 13:32:41) [MSC v.1900 64 bit (AMD64)]
Pandas version:0.23.0
Matplotlib version:2.2.2

In [2]:
names = ['Bob', 'Jessica', 'Mary', "John", 'Mel']
births = [968, 155, 77, 578, 973]

In [4]:
BabyDataSet = list(zip(names, births))
BabyDataSet

[('Bob', 968), ('Jessica', 155), ('Mary', 77), ('John', 578), ('Mel', 973)]

In [5]:
df = pd.DataFrame(data = BabyDataSet, columns=['Names', 'Births'])
df

     Names  Births
0      Bob     968
1  Jessica     155
2     Mary      77
3     John     578
4      Mel     973

In [6]:
df.to_csv('births1880.csv', index=False, header=False)

In [10]:
location=r'births1880.csv'

In [11]:
df = pd.read_csv(location, header=None)
df

         0    1
0      Bob  968
1  Jessica  155
2     Mary   77
3     John  578
4      Mel  973

In [13]:
df = pd.read_csv(location, names=['Names', 'Births'])
df

     Names  Births
0      Bob     968
1  Jessica     155
2     Mary      77
3     John     578
4      Mel     973

In [15]:
#read_csv?
import os
os.remove(location)

In [16]:
df.dtypes

Names     object
Births     int64
dtype: object

In [30]:
Sorted = df.sort_values(['Births'], ascending=False)
Sorted.head(1)
Sorted['Names'].head(1).values

array(['Mel'], dtype=object)

In [24]:
df['Births'].max()

973

In [7]:
df['Births'].plot()
MaxValue=df['Births'].max()
MaxName = df['Names'][df['Births'] == MaxValue].values
Text = str(MaxValue) + "-" + MaxName
plt.annotate(Text, xy=(1, MaxValue), xytext=(8, 0),
            xycoords=('axes fraction', 'data'), textcoords='offset points')
df[df['Births'] == MaxValue]

NameError: name 'df' is not defined

In [41]:
from numpy import random

In [43]:
random.seed(500)
random_names = [names[random.randint(0, len(names))] for i in range(1000)]
random_names[:10]

['Mary',
 'Jessica',
 'Jessica',
 'Bob',
 'Jessica',
 'Jessica',
 'Jessica',
 'Mary',
 'Mary',
 'Mary']

In [46]:
births = [random.randint(0, 1000) for i in range(1000)]
births[:10]

[48, 217, 479, 499, 946, 229, 178, 650, 373, 77]

In [49]:
BabyDataSet = list(zip(random_names, births))
BabyDataSet[:10]

     Names  Births
0     Mary      48
1  Jessica     217
2  Jessica     479
3      Bob     499
4  Jessica     946

In [51]:
df = pd.DataFrame(data=BabyDataSet, columns=['Names', 'Births'])
df.head()
df.tail()

       Names  Births
995     John     700
996  Jessica     801
997     John     479
998  Jessica      48
999     John     440

In [2]:
location = 'births1880.txt'
df.to_csv(location, index=False, header=False)

NameError: name 'df' is not defined

In [1]:
df.head()

NameError: name 'df' is not defined

In [54]:
df = pd.read_csv(location)

In [57]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 999 entries, 0 to 998
Data columns (total 2 columns):
Mary    999 non-null object
48      999 non-null int64
dtypes: int64(1), object(1)
memory usage: 15.7+ KB

In [58]:
df.head()

      Mary   48
0  Jessica  217
1  Jessica  479
2      Bob  499
3  Jessica  946
4  Jessica  229

In [59]:
df = pd.read_csv(location, header=None)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
0    1000 non-null object
1    1000 non-null int64
dtypes: int64(1), object(1)
memory usage: 15.7+ KB

In [60]:
df.tail()

           0    1
995     John  700
996  Jessica  801
997     John  479
998  Jessica   48
999     John  440

In [61]:
df = pd.read_csv(location, names=['Names', 'Births'])
df.head(6)

     Names  Births
0     Mary      48
1  Jessica     217
2  Jessica     479
3      Bob     499
4  Jessica     946
5  Jessica     229

In [62]:
os.remove(location)

In [63]:
df['Names'].unique()

array(['Mary', 'Jessica', 'Bob', 'John', 'Mel'], dtype=object)

In [64]:
for x in df['Names'].unique():
    print(x)

Mary
Jessica
Bob
John
Mel

In [65]:
df['Names'].describe()

count     1000
unique       5
top        Bob
freq       206
Name: Names, dtype: object

In [66]:
name = df.groupby('Names')
df = name.sum()
df

         Births
Names
Bob      104818
Jessica  100588
John      93812
Mary     101035
Mel      100761

In [67]:
Sorted = df.sort_values(['Births'], ascending=False)
Sorted.head(1)

       Births
Names
Bob    104818

In [6]:
df['Births'].plot.bar()
df.sort_values(by='Births', ascending=False)

NameError: name 'df' is not defined

In [81]:
random.seed(111)
def CreateDataSet(Number=1):
    Output = []
    for i in range(Number):
        rng = pd.date_range(start='1/1/2009', end='12/31/2012', freq='W-MON')
        data = random.randint(low=25, high=1000, size=len(rng))
        status = [1, 2, 3]
        random_status = [status[random.randint(0, len(status))] for i in range(len(rng))]
        
        states = ['GA', 'FL', "fl", 'NY', "NJ", 'TX']
        
        random_states = [states[random.randint(0, len(states))] for i in range(len(rng))]
        
        Output.extend(zip(random_states, random_status, data, rng))
        
    return Output

In [82]:
dataset = CreateDataSet(4)
df = pd.DataFrame(data=dataset, columns=['State', 'Status', 'CustomerCount', 'StatusDate'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 836 entries, 0 to 835
Data columns (total 4 columns):
State            836 non-null object
Status           836 non-null int64
CustomerCount    836 non-null int64
StatusDate       836 non-null datetime64[ns]
dtypes: datetime64[ns](1), int64(2), object(1)
memory usage: 26.2+ KB

In [83]:
df.head()

  State  Status  CustomerCount StatusDate
0    GA       1            877 2009-01-05
1    FL       1            901 2009-01-12
2    fl       3            749 2009-01-19
3    FL       3            111 2009-01-26
4    GA       1            300 2009-02-02

In [84]:
df.to_excel('lesson3.xlsx', index=False)

In [86]:
location = 'lesson3.xlsx'
df = pd.read_excel(location, 0, index_col='StatusDate')

In [90]:
df.describe()

           Status  CustomerCount
count  836.000000     836.000000
mean     2.021531     512.520335
std      0.815723     285.716921
min      1.000000      26.000000
25%      1.000000     259.750000
50%      2.000000     515.500000
75%      3.000000     753.000000
max      3.000000     999.000000

In [91]:
df.index

DatetimeIndex(['2009-01-05', '2009-01-12', '2009-01-19', '2009-01-26',
               '2009-02-02', '2009-02-09', '2009-02-16', '2009-02-23',
               '2009-03-02', '2009-03-09',
               ...
               '2012-10-29', '2012-11-05', '2012-11-12', '2012-11-19',
               '2012-11-26', '2012-12-03', '2012-12-10', '2012-12-17',
               '2012-12-24', '2012-12-31'],
              dtype='datetime64[ns]', name='StatusDate', length=836, freq=None)

In [93]:
df.head()

           State  Status  CustomerCount
StatusDate
2009-01-05    GA       1            877
2009-01-12    FL       1            901
2009-01-19    fl       3            749
2009-01-26    FL       3            111
2009-02-02    GA       1            300

In [94]:
df['State'].unique()

array(['GA', 'FL', 'fl', 'TX', 'NY', 'NJ'], dtype=object)

In [95]:
df['State'] = df.State.apply(lambda x: x.upper())
df['State'].unique()

array(['GA', 'FL', 'TX', 'NY', 'NJ'], dtype=object)

In [97]:
mask = df['Status'] == 1
df = df[mask]
df

           State  Status  CustomerCount
StatusDate
2009-01-05    GA       1            877
2009-01-12    FL       1            901
2009-02-02    GA       1            300
2009-03-09    NY       1            992
2009-04-06    FL       1            291
2009-04-27    NJ       1            753
2009-05-25    TX       1             46
2009-07-06    FL       1            723
2009-07-20    FL       1            710
2009-07-27    NJ       1            990
2009-08-10    GA       1            568
2009-08-24    FL       1            991
2009-09-14    NJ       1            772
2009-09-21    FL       1            495
2009-09-28    NJ       1            349
2009-10-05    FL       1            508
2009-10-12    NY       1            694
2010-01-04    FL       1             99
2010-01-25    NY       1            640
2010-02-15    TX       1            148
2010-03-01    FL       1            871
2010-04-12    NJ       1            375
2010-05-17    GA       1             89
2010-05-24    NY       1            538
2010-07-19    TX       1             94
2010-07-26    NY       1            314
2010-08-02    NJ       1            261
2010-08-09    TX       1            185
2010-08-30    NJ       1             79
2010-09-06    NJ       1            708
...          ...     ...            ...
2011-02-07    GA       1            371
2011-02-21    GA       1            699
2011-03-14    FL       1            333
2011-04-18    FL       1            398
2011-04-25    GA       1            910
2011-05-30    TX       1            126
2011-07-04    NJ       1            998
2011-07-11    NJ       1            878
2011-08-08    GA       1            223
2011-08-15    NJ       1            730
2011-08-29    FL       1            865
2011-10-03    FL       1            742
2011-11-14    NY       1            747
2011-11-28    FL       1            142
2011-12-05    FL       1            606
2012-01-02    NJ       1            784
2012-01-16    GA       1            240
2012-02-06    NJ       1            649
2012-03-05    NJ       1            433
2012-03-12    NJ       1            858
2012-03-19    NY       1            607
2012-04-23    TX       1            516
2012-04-30    TX       1            471
2012-05-07    FL       1            670
2012-06-04    NY       1            410
2012-06-18    FL       1            669
2012-08-06    TX       1            178
2012-08-20    TX       1            248
2012-10-08    FL       1            716
2012-10-22    NJ       1            955

[269 rows x 3 columns]

In [98]:
mask = df.State == 'NJ'
df['State'][mask] = 'NY'

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

In [99]:
df['State'].unique()

array(['GA', 'FL', 'NY', 'TX'], dtype=object)

In [5]:
df['CustomerCount'].plot(figsize=(15,5))

NameError: name 'df' is not defined

In [101]:
sortdf = df[df['State'] == 'NY'].sort_index(axis=0)
sortdf.head(10)

           State  Status  CustomerCount
StatusDate
2009-01-19    NY       1            522
2009-02-23    NY       1            710
2009-03-09    NY       1            992
2009-03-16    NY       1            355
2009-03-23    NY       1            728
2009-03-30    NY       1            863
2009-04-13    NY       1            520
2009-04-20    NY       1            820
2009-04-20    NY       1            937
2009-04-27    NY       1            447

In [105]:
Daily = df.reset_index().groupby(['State', 'StatusDate']).sum()
Daily.head()

                  Status  CustomerCount
State StatusDate
FL    2009-01-12       1            901
      2009-02-02       1            653
      2009-03-23       1            752
      2009-04-06       2           1086
      2009-06-08       1            649

In [106]:
del Daily['Status']
Daily.head()

                  CustomerCount
State StatusDate
FL    2009-01-12            901
      2009-02-02            653
      2009-03-23            752
      2009-04-06           1086
      2009-06-08            649

In [3]:
Daily.index

NameError: name 'Daily' is not defined

In [110]:
Daily.index.levels[0]

Index(['FL', 'GA', 'NY', 'TX'], dtype='object', name='State')

In [4]:
Daily.loc['FL'].plot()
Daily.loc['GA'].plot()
Daily.loc['NY'].plot()
Daily.loc['TX'].plot()

NameError: name 'Daily' is not defined